
# Scrapy Project Analyzing Zoo Data
## by Connor Haas

In [119]:
import pandas as pd
import numpy as np
import re

In [181]:
import csv
#extracting csv file with zoo name and data
zooDF = pd.read_csv(r'C:\Users\conma\Desktop\NYCDSA\Webscraping\ScrapyProject\zoo_data\zoodata.csv')
countryDF = pd.read_csv(r'C:\Users\conma\Desktop\NYCDSA\Webscraping\ScrapyProject\country_data\countrydata.csv')

In [213]:
zooDF

,address,city,country,name,name_url,num_animals,num_species,state
0,2070 Zoo Ln,Abilene,United States,Abilene Zoological Gardens,https://en.wikipedia.org/wiki/Abilene_Zoologic...,1100,1100,Texas
1,701 Whirlpool Street,New York,United States,Aquarium of Niagara,https://en.wikipedia.org/wiki/Aquarium_of_Niagara,NaN,NaN,New York
2,2595 Roblin Blvd,Winnipeg,Canada,Assiniboine Park Zoo,https://en.wikipedia.org/wiki/Assiniboine_Park...,200,200,Manitoba
3,500 Edgewood Ave,Akron,United States,Akron Zoological Park,https://en.wikipedia.org/wiki/Akron_Zoo,700,700,Ohio
4,11 Oriente #2407,Puebla,Mexico,Africam Safari Park,https://en.wikipedia.org/wiki/Africam_Safari_Park,2500,2500,Puebla
...,...,...,...,...,...,...,...,...
245,2600 Deweese Parkway,Dayton,United States,Boonshoft Museum of Discovery,https://en.wikipedia.org/wiki/Boonshoft_Museum...,NaN,NaN,Ohio
246,7401 SW 9th St,Des Moines,United States,Blank Park Zoo,https://en.wikipedia.org/wiki/Blank_Park_Zoo,"1,484","1,484",Iowa
247,"USCD, 9500 Gilman Dr",La Jolla,United States,Birch Aquarium at Scripps,https://en.wikipedia.org/wiki/Birch_Aquarium,"3,000+","3,000+",California
248,7400 Division Dr,Battle Creek,United States,Binder Park Zoo,https://en.wikipedia.org/wiki/Binder_Park_Zoo,500,500,Michigan
249,PO Box FL 145,Flatts Village,NaN,"Bermuda Aquarium, Museum and Zoo",https://en.wikipedia.org/wiki/Bermuda_Aquarium...,300,300,Bermuda

In [210]:
countryDF2 = pd.DataFrame([])
zooDF2 = pd.DataFrame([])

In [125]:
countryDF

,city_2016_land_area,city_name,pop_2018,pop_density
0,"301.5Â sqÂ mi\n,468.7Â sqÂ mi\n,227.3Â sqÂ mi\n,637....","New York,[d],Los Angeles,Chicago,Houston,[3],P...","8,398,748\n,3,990,456\n,2,705,994\n,2,325,502\...","28,317/sqÂ mi\n,8,484/sqÂ mi\n,11,900/sqÂ mi\n,3,..."
1,"102.3Â km,\n,69.9Â km,\n,53.6Â km,\n,79.5Â km,\n,2...","San Juan,BayamÃ³n,Carolina,Ponce,Caguas","395,326\n,208,116\n,176,762\n,166,327\n,142,893\n","3,297/km,\n,2,568/km,\n,2,881/km,\n,1,771/km,\..."
2,"120.996Â km,\n,67.288Â km,\n,86.381Â km,\n,86.055...","Nevada,Virginia,Nevada,Nevada,Louisiana,Califo...","186,070\n,189,453\n,156,120\n,117,390\n,146,13...","1,844/km,\n,3,086/km,\n,2,192/km,\n,2,073/km,\..."
3,"2.30% from 2000 to 2010\n,annexed by , in 1907...","New York,Pennsylvania,New York,New Jersey,Ohio...","(1950)\n, (1900)\n, (1890)\n, (1950)\n, (1950...",NaN

In [211]:
#split landArea string and clean into dataframe
landArea = countryDF.loc[0,'city_2016_land_area'].split('\n')
landArea = list(map(lambda s: re.sub('[^0-9.]','',s),landArea))
landArea = list(map(lambda s: float(s),landArea[:-1]))
countryDF2['land_area'] = np.array(landArea)

#split city names string and clean into dataframe
city_name = countryDF.loc[0,'city_name'].split(',')
for e in city_name:
    if '[' in e:
        city_name.remove(e)
np.array(city_name).size
countryDF2['city_name'] = np.array(city_name)

#split population of city and clean into dataframe
pop_2018 = countryDF.replace(',','',regex=True).loc[0,'pop_2018'].split('\n')
pop_2018 = list(map(lambda s: int(s),pop_2018[:-1]))
np.array(pop_2018).size
countryDF2['pop_2018'] = np.array(pop_2018)

popD = countryDF.loc[0,'pop_density'].replace(',','').split('\n')
popD = list(map(lambda s: re.sub('[^0-9]','',s),popD))
popD = list(map(lambda s: int(s), popD[:-1]))
np.array(popD).size
countryDF2['Population_Density'] = np.array(popD)

countryDF2

     land_area    city_name  pop_2018  Population_Density
0        301.5     New York   8398748               28317
1        468.7  Los Angeles   3990456                8484
2        227.3      Chicago   2705994               11900
3        637.5      Houston   2325502                3613
4        517.6      Phoenix   1660272                3120
..         ...          ...       ...                 ...
309       30.1       Edison    100693                3389
310       23.3   Woodbridge    100450                4351
311       59.9   San Angelo    100215                1681
312       28.0      Kenosha    100164                3577
313       29.0    Vacaville    100154                3449

[314 rows x 4 columns]

In [208]:
landArea = countryDF.loc[0,'city_2016_land_area'].split('\n')
landArea = list(map(lambda s: re.sub('[^0-9.]','',s),landArea))
landArea = list(map(lambda s: float(s),landArea[:-1]))
countryDF2['land_area'] = np.array(landArea)
countryDF2

       city_name  pop_2018  Population_Density  land_area
0       New York   8398748               28317      301.5
1    Los Angeles   3990456                8484      468.7
2        Chicago   2705994               11900      227.3
3        Houston   2325502                3613      637.5
4        Phoenix   1660272                3120      517.6
..           ...       ...                 ...        ...
309       Edison    100693                3389       30.1
310   Woodbridge    100450                4351       23.3
311   San Angelo    100215                1681       59.9
312      Kenosha    100164                3577       28.0
313    Vacaville    100154                3449       29.0

[314 rows x 4 columns]

In [192]:
city_name = countryDF.loc[0,'city_name'].split(',')
for e in city_name:
    if '[' in e:
        city_name.remove(e)
np.array(city_name).size
countryDF2['city_name'] = np.array(city_name)
countryDF2

       city_name
0       New York
1    Los Angeles
2        Chicago
3        Houston
4        Phoenix
..           ...
309       Edison
310   Woodbridge
311   San Angelo
312      Kenosha
313    Vacaville

[314 rows x 1 columns]

In [193]:
pop_2018 = countryDF.replace(',','',regex=True).loc[0,'pop_2018'].split('\n')
pop_2018 = list(map(lambda s: int(s),pop_2018[:-1]))
np.array(pop_2018).size
countryDF2['pop_2018'] = np.array(pop_2018)
countryDF2

       city_name  pop_2018
0       New York   8398748
1    Los Angeles   3990456
2        Chicago   2705994
3        Houston   2325502
4        Phoenix   1660272
..           ...       ...
309       Edison    100693
310   Woodbridge    100450
311   San Angelo    100215
312      Kenosha    100164
313    Vacaville    100154

[314 rows x 2 columns]

In [194]:
popD = countryDF.loc[0,'pop_density'].replace(',','').split('\n')
popD = list(map(lambda s: re.sub('[^0-9]','',s),popD))
popD = list(map(lambda s: int(s), popD[:-1]))
np.array(popD).size
countryDF2['Population_Density'] = np.array(popD)
countryDF2

       city_name  pop_2018  Population_Density
0       New York   8398748               28317
1    Los Angeles   3990456                8484
2        Chicago   2705994               11900
3        Houston   2325502                3613
4        Phoenix   1660272                3120
..           ...       ...                 ...
309       Edison    100693                3389
310   Woodbridge    100450                4351
311   San Angelo    100215                1681
312      Kenosha    100164                3577
313    Vacaville    100154                3449

[314 rows x 3 columns]